In [1]:
# Pandas
import pandas as pd
import psycopg2

# SQL Alchemy
from sqlalchemy import create_engine

# import password

from get_pass import password

In [2]:
conn = psycopg2.connect(
    host="localhost",
    database="sql-challenge",
    user="postgres",
    password=password)

In [3]:
# Query All Records in the the Database
data = pd.read_sql("SELECT * FROM employee", conn)

In [4]:
data.head()

   empl_id title_id  birth_date  first_name  last_name sex   hire_date
0   473302    s0001  1953-07-25    Hideyuki   Zallocco   M  1990-04-28
1   475053    e0002  1954-11-18       Byong  Delgrande   F  1991-09-07
2    57444    e0002  1958-01-30       Berry       Babb   F  1992-03-21
3   421786    s0001  1957-09-28       Xiong   Verhoeff   M  1987-11-26
4   282238    e0003  1952-10-28  Abdelkader    Baumann   F  1991-01-18